src/cf/InformationRegisters/уатСвязанныеДокументыЭПД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатСвязанныеДокументыЭПД</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>QR</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЭПД</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйПутевойЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйЗаказЗаявка</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектроннаяТранспортнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектроннаяСопроводительнаяВедомость</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказНаТС</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатМаршрутныйЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.уатПутевойЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.уатЗаказПеревозчику_уэ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СостоянияПоОбъектамУчетаЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостоянияПоОбъектамУчетаЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СостояниеЭДО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияДокументовЭДО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьЭлектронныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйДокументВходящийЭДО</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйДокументИсходящийЭДО</v8:Type>
						<v8:Type>cfg:CatalogRef.СообщениеЭДОПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьДействияСНашейСтороны</Name>
					<Comment>Признак необходимости выполнения какого-либо действия с ЭД с нашей стороны</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьСводныеСостоянияЭДО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьДействияСоСтороныДругогоУчастника</Name>
					<Comment>Признак ожидания выполнения какого-либо действия со стороны другого участника ЭД</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьСводныеСостоянияЭДО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеСостояния</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникЭДО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованияЭлектронныхДокументовЭДО</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonForms/уатФормаПодбораЭПД/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("мсвМаршрутныеЛистыИЗаказы") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("ТипЭПД", ТипЭПД);
	Если НЕ ЗначениеЗаполнено(ТипЭПД) Тогда
		ТипЭПД = Тип("ДокументСсылка.ЭлектроннаяТранспортнаяНакладная");
	КонецЕсли; 
	
	// Заполнение документов в таблицах
	мсвМаршрутныеЛистыИЗаказы = ЗаполнитьДанныеЗаказов(Параметры.мсвМаршрутныеЛистыИЗаказы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ВладелецФормы = Неопределено Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("en='Immediate opening for this object is prohibited!';ru='Непосредственное открытие для данного объекта запрещено!'"), 10);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	УстановитьВидимость();
	ПересчитатьНомерДокументаЭДО();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьНомерДокументаЭДО()
	 
	Если НЕ ГруппироватьДокументыЭПД Тогда
		НомерЭПД = 1;
		Для Каждого ТекСтрока Из НовыеДокументы Цикл
			Если ЗначениеЗаполнено(ТекСтрока.ЭПД) Тогда
				ТекСтрока.НомерДокументаЭПД = 0;
				ТекСтрока.ФлагВыбора        = Ложь;
			Иначе
				ТекСтрока.НомерДокументаЭПД = НомерЭПД;
				НомерЭПД = НомерЭПД + 1; 
			КонецЕсли;
		КонецЦикла;  
	Иначе
		Для Каждого ТекСтрока Из НовыеДокументы Цикл
			ТекСтрока.НомерДокументаЭПД = 0;
		КонецЦикла;
		Сгруппировали = Ложь;
		
		НомерЭПД = 1;
		Для Каждого ТекСтрока Из НовыеДокументы Цикл 
			Если ТекСтрока.НомерДокументаЭПД <> 0 Тогда
				Продолжить;
			КонецЕсли;
			Если ЗначениеЗаполнено(ТекСтрока.ЭПД) Тогда
				ТекСтрока.НомерДокументаЭПД = 0;
				ТекСтрока.ФлагВыбора        = Ложь;
			Иначе  
				ПараметрыОтбора = Новый Структура("МаршрутныйЛист,ТС,Грузоотправитель,Грузополучатель,ПунктОтправления,ПунктНазначения");
				ЗаполнитьЗначенияСвойств(ПараметрыОтбора, ТекСтрока);
				СтрокиГруппировки = НовыеДокументы.НайтиСтроки(ПараметрыОтбора); 
				
				Индекс = 1;
				Для Каждого ТекСтрокаГруппировки Из СтрокиГруппировки Цикл 
					Если ЗначениеЗаполнено(ТекСтрокаГруппировки.ЭПД) Тогда
						ТекСтрокаГруппировки.НомерДокументаЭПД = 0;
					Иначе
						ТекСтрокаГруппировки.НомерДокументаЭПД = НомерЭПД;
						Индекс = Индекс + 1;
					КонецЕсли;
				КонецЦикла;
				Если Индекс > 2 Тогда
					Сгруппировали = Истина;
				КонецЕсли;
				НомерЭПД = НомерЭПД + 1;
			КонецЕсли;
		КонецЦикла; 
		НовыеДокументы.Сортировать("НомерДокументаЭПД"); 
		Если НЕ Сгруппировали Тогда 
			ТекстСообщения = Нстр("ru = 'В строках нет Заказов на ТС, которые можно было бы объединить в 1 ЭПД с учетом совпадения ключевых полей'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	Для Каждого ТекЛистИЗаказ из НовыеДокументы Цикл 
		Если НЕ ЗначениеЗаполнено(ТекЛистИЗаказ.ЭПД) Тогда
			ТекЛистИЗаказ.ФлагВыбора = Истина; 
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	Для Каждого ТекЛистИЗаказ из НовыеДокументы Цикл
		ТекЛистИЗаказ.ФлагВыбора = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	НайденныеСтроки = НовыеДокументы.НайтиСтроки(Новый Структура("ФлагВыбора", Истина));
	ЕстьОшибки = Ложь;
	Если ТипЭПД = "ПФ_MXL_уатЗаказЗаявка" Тогда
		МассивОбъектов    = Новый Массив();
		СоответвиеЗаказов = Новый Соответствие();
		Для Каждого ТекСтрока Из НайденныеСтроки Цикл  
			МассивОбъектов.Добавить(текСтрока.Заказ);
			СоответвиеЗаказов.Вставить(текСтрока.Заказ, текСтрока.МаршрутныйЛист);
		КонецЦикла;
		Закрыть(Новый Структура("МассивОбъектов, СоответвиеЗаказов", МассивОбъектов, СоответвиеЗаказов));
	Иначе 
		
		ДокументыВыбраны = Ложь;
		Для Каждого ТекСтрока Из НовыеДокументы Цикл  
			Если НЕ ТекСтрока.ФлагВыбора Тогда
				Продолжить;
			КонецЕсли; 
			
			Если ТекСтрока.НомерДокументаЭПД = 0 Тогда
				МассивДокументОснование = Новый Массив();
				МассивДокументОснование.Добавить(ТекСтрока.Заказ); 
				Если ЗначениеЗаполнено(ТекСтрока.МаршрутныйЛист)
					И МассивДокументОснование.Найти(ТекСтрока.МаршрутныйЛист) = Неопределено Тогда
					МассивДокументОснование.Добавить(ТекСтрока.МаршрутныйЛист); 
				КонецЕсли;
				ДопПараметры = Неопределено;
				Если флВыборГруза Тогда
					ДопПараметры = Новый Массив();
					Для Каждого ТекГруз Из ТекСтрока.Груз Цикл
						ДопПараметрыСтрока = Новый Структура("Груз,ПунктОтправления,ПунктНазначения,Грузоотправитель,Грузополучатель,
						|Количество,КоличествоМест,КоличествоТоваров,КоличествоГрузовыхМест,ВесБрутто,Объем,Цена,Сумма"); 
						ЗаполнитьЗначенияСвойств(ДопПараметрыСтрока, ТекСтрока);
						ДопПараметрыСтрока.Груз = ТекГруз.Значение; 
						ДопПараметры.Добавить(ДопПараметрыСтрока);
					КонецЦикла;
				КонецЕсли;
				
				ДокументыВыбраны = Истина;
				уатОбменСГИСЭПДКлиент.СоздатьЭПД(ТипЭПД, МассивДокументОснование, ВладелецФормы, ДопПараметры, ЕстьОшибки);
				
			Иначе
				
				НайденныеСтроки = НовыеДокументы.НайтиСтроки(Новый Структура("ФлагВыбора, НомерДокументаЭПД", Истина, ТекСтрока.НомерДокументаЭПД));
				
				МассивДокументОснование = Новый Массив();
				ДопПараметры            = Новый Массив();
				Для Каждого ТекСтрокаГруппировки Из НайденныеСтроки Цикл
					
					МассивДокументОснование.Добавить(ТекСтрокаГруппировки.Заказ); 
					Если ЗначениеЗаполнено(ТекСтрокаГруппировки.МаршрутныйЛист)
						И МассивДокументОснование.Найти(ТекСтрокаГруппировки.МаршрутныйЛист) = Неопределено Тогда
						МассивДокументОснование.Добавить(ТекСтрокаГруппировки.МаршрутныйЛист); 
					КонецЕсли; 
					Если флВыборГруза Тогда
						Для Каждого ТекГруз Из ТекСтрокаГруппировки.Груз Цикл
							ДопПараметрыСтрока = Новый Структура("Груз,ПунктОтправления,ПунктНазначения,Грузоотправитель,Грузополучатель,
							|Количество,КоличествоМест,КоличествоТоваров,КоличествоГрузовыхМест,ВесБрутто,Объем,Цена,Сумма"); 
							ЗаполнитьЗначенияСвойств(ДопПараметрыСтрока, ТекСтрокаГруппировки);
							ДопПараметрыСтрока.Груз = ТекГруз.Значение;
							ДопПараметры.Добавить(ДопПараметрыСтрока);
						КонецЦикла;
					КонецЕсли;
				КонецЦикла; 
				ДокументыВыбраны = Истина;
				уатОбменСГИСЭПДКлиент.СоздатьЭПД(ТипЭПД, МассивДокументОснование, ВладелецФормы, ДопПараметры, ЕстьОшибки);
				Если ЕстьОшибки Тогда
					Продолжить;
				Иначе
					Для Каждого ТекСтрокаГруппировки Из НайденныеСтроки Цикл
						ТекСтрокаГруппировки.ФлагВыбора = Ложь; 
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если НЕ ДокументыВыбраны Тогда
			ТекстСообщения = Нстр("ru = 'Для формирования документов ЭПД не выбраны соответствующие группы документов.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		ИначеЕсли ЕстьОшибки Тогда 
			ТекстСообщения = Нстр("ru = 'В процессе создания документов ЭПД обнаружены ошибки: документы для выбранных групп не сформированы. Проверьте корректность настроек ЭДО: Администрирование → Обмен электронными документами → Обмен с контрагентами → Настройки ЭДО.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		ИначеЕсли НЕ ЕстьОшибки Тогда
			Закрыть();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Сгруппировать(Команда)
	ГруппироватьДокументыЭПД = Истина;
	ПересчитатьНомерДокументаЭДО();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте                          
Процедура УстановитьВидимость() 
	Элементы.НовыеДокументыОписаниеГруза.Видимость     = флВыборГруза;
	Элементы.НовыеДокументыЗаказРодитель.Видимость     = флЕстьМультимодальныеЗаказы;
	Элементы.НовыеДокументыВодитель.Видимость          = ТипЭПД = Тип("ДокументСсылка.ЭлектроннаяТранспортнаяНакладная");
	Элементы.НовыеДокументыТС.Заголовок                = ?(ТипЭПД = Тип("ДокументСсылка.ЭлектроннаяТранспортнаяНакладная"), Нстр("ru = 'ТС'"), Нстр("ru = 'Требование к типу ТС'"));
КонецПроцедуры

&НаСервере
Функция ЗаполнитьДанныеЗаказов(мсвМаршрутныеЛистыИЗаказы)  
	
	ТаблицаЗаказов = Новый ТаблицаЗначений();
	ТаблицаЗаказов.Колонки.Добавить("ИндексДанных",			 Новый ОписаниеТипов("Число"));
	ТаблицаЗаказов.Колонки.Добавить("МаршрутныйЛист",		 Новый ОписаниеТипов("ДокументСсылка.уатПутевойЛист, ДокументСсылка.уатМаршрутныйЛист, ДокументСсылка.уатЗаказПеревозчику_уэ"));
	ТаблицаЗаказов.Колонки.Добавить("Заказ",				 Новый ОписаниеТипов("ДокументСсылка.уатЗаказГрузоотправителя"));  
	
	ИндексДанных = 0;
	Для Каждого ТекЛистИЗаказ Из мсвМаршрутныеЛистыИЗаказы Цикл
		
		ТекЛистИЗаказ.Вставить("ИндексДанных", ИндексДанных); 
		НоваяСтрока = ТаблицаЗаказов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекЛистИЗаказ);
		НоваяСтрока.ИндексДанных = ИндексДанных;
		
		ИндексДанных = ИндексДанных + 1;
	КонецЦикла;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ТаблицаЗаказов", ТаблицаЗаказов);
	Запрос.Текст = "ВЫБРАТЬ  
	               |	ТаблицаЗаказов.ИндексДанных КАК ИндексДанных,
	               |	ТаблицаЗаказов.Заказ КАК Заказ,
	               |	ТаблицаЗаказов.МаршрутныйЛист КАК МаршрутныйЛист
	               |ПОМЕСТИТЬ втЗаказыНаТС
	               |ИЗ
	               |	&ТаблицаЗаказов КАК ТаблицаЗаказов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ 
	               |	втЗаказыНаТС.ИндексДанных КАК ИндексДанных,
	               |	втЗаказыНаТС.Заказ КАК Заказ,
	               |	втЗаказыНаТС.МаршрутныйЛист КАК МаршрутныйЛист,
	               |	втЗаказыНаТС.Заказ.ЭтоЭтап КАК ЭтоЭтап, 
	               |	втЗаказыНаТС.Заказ.Мультимодальный КАК Мультимодальный,
	               |	втЗаказыНаТС.Заказ.РодительскийЗаказ КАК РодительскийЗаказ,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(втЗаказыНаТС.МаршрутныйЛист) = ТИП(Документ.уатПутевойЛист)
	               |			ТОГДА втЗаказыНаТС.МаршрутныйЛист.ТранспортноеСредство
	               |		ИНАЧЕ втЗаказыНаТС.МаршрутныйЛист.ТС
	               |	КОНЕЦ КАК ТС,
	               |	втЗаказыНаТС.Заказ.ТребованиеКТСТипТС КАК ТребованиеКТСТипТС,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(втЗаказыНаТС.МаршрутныйЛист) = ТИП(Документ.уатЗаказПеревозчику_уэ)
	               |			ТОГДА втЗаказыНаТС.МаршрутныйЛист.Водитель
	               |		ИНАЧЕ втЗаказыНаТС.МаршрутныйЛист.Водитель1
	               |	КОНЕЦ КАК Водитель,
	               |	втЗаказыНаТС.МаршрутныйЛист.Контрагент КАК Перевозчик
	               |ИЗ
	               |	втЗаказыНаТС КАК втЗаказыНаТС";
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивЗаказНаТС    = Новый Массив();
	ЗначенияРеквизитов = Новый Соответствие();
	Пока Выборка.Следующий() Цикл   
		ЗначениеРеквизитов = Новый Структура("ЭтоЭтап,Мультимодальный,
		|РодительскийЗаказ,ТС,Водитель,Перевозчик");
		ЗаполнитьЗначенияСвойств(ЗначениеРеквизитов, Выборка);
		Если ТипЭПД = Тип("ДокументСсылка.ЭлектроннаяТранспортнаяНакладная") Тогда
			ЗначениеРеквизитов.ТС = Выборка.ТС; 
		Иначе 
			ЗначениеРеквизитов.ТС = Выборка.ТребованиеКТСТипТС;
		КонецЕсли;
		ЗначенияРеквизитов.Вставить(Выборка.ИндексДанных, ЗначениеРеквизитов);
		
		МассивЗаказНаТС.Добавить(Выборка.Заказ);
	КонецЦикла;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МассивЗаказНаТС", МассивЗаказНаТС);
	Запрос.УстановитьПараметр("ТипЭПД", ТипЭПД);
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	уатСвязанныеДокументыЭПД.ЭПД КАК ЭПД,
	               |	уатСвязанныеДокументыЭПД.ЗаказНаТС КАК ЗаказНаТС,
	               |	уатСвязанныеДокументыЭПД.Рейс КАК Рейс,
	               |	СостоянияПоОбъектамУчетаЭДО.СостояниеЭДО КАК СостояниеЭДО
	               |ИЗ
	               |	РегистрСведений.уатСвязанныеДокументыЭПД КАК уатСвязанныеДокументыЭПД
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияПоОбъектамУчетаЭДО КАК СостоянияПоОбъектамУчетаЭДО
	               |		ПО уатСвязанныеДокументыЭПД.ЭПД = СостоянияПоОбъектамУчетаЭДО.СсылкаНаОбъект
	               |ГДЕ
	               |	уатСвязанныеДокументыЭПД.ЗаказНаТС В(&МассивЗаказНаТС)
	               |	И ТИПЗНАЧЕНИЯ(уатСвязанныеДокументыЭПД.ЭПД) = &ТипЭПД";
	Выборка = Запрос.Выполнить().Выбрать(); 
	ДокументыЭПД = Новый Соответствие();
	Пока Выборка.Следующий() Цикл   
		ДокументыЭПД.Вставить(Выборка.ЗаказНаТС, Выборка.ЭПД);
	КонецЦикла; 
	
	флВыборГруза = Ложь; 
	
	Для Каждого ТекЛистИЗаказ Из мсвМаршрутныеЛистыИЗаказы Цикл
		
		Строка = НовыеДокументы.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, ТекЛистИЗаказ);
		
		Если ТипЭПД = Тип("ДокументСсылка.ЭлектроннаяТранспортнаяНакладная") Тогда
			Если ТекЛистИЗаказ.Свойство("МассивГрузов") Тогда
				Для Каждого ТекГруз Из ТекЛистИЗаказ.МассивГрузов Цикл 
					Строка.ОписаниеГруза = ?(ЗначениеЗаполнено(Строка.ОписаниеГруза), Строка.ОписаниеГруза + ", ", "") + Строка(ТекГруз); 
					Строка.Груз.Добавить(ТекГруз);
				КонецЦикла;
			КонецЕсли; 
		Иначе
			Строка.ОписаниеГруза = Строка.Заказ.НазваниеГруза;
		КонецЕсли;
		Строка.флагВыбора = Истина;
		
		Если ТекЛистИЗаказ.Свойство("Груз") Тогда
			флВыборГруза = Истина;
		КонецЕсли;

		ЗначениеРеквизитов = ЗначенияРеквизитов.Получить(ТекЛистИЗаказ.ИндексДанных);
		Если ЗначениеРеквизитов <> Неопределено Тогда 
			ЗаполнитьЗначенияСвойств(Строка, ЗначениеРеквизитов); 
			
			Если ЗначениеРеквизитов.ЭтоЭтап Тогда
				флЕстьМультимодальныеЗаказы = Истина;
				Строка.ЗаказРодитель        = ЗначениеРеквизитов.РодительскийЗаказ;
			ИначеЕсли ЗначениеРеквизитов.Мультимодальный Тогда
				флЕстьМультимодальныеЗаказы = Истина;
			КонецЕсли;
		КонецЕсли; 
		
		Строка.ЭПД = ДокументыЭПД.Получить(ТекЛистИЗаказ.Заказ); 
	КонецЦикла; 
	
КонецФункции

#КонецОбласти
